In [84]:
#wrangle data
import warnings
warnings.filterwarnings('ignore')

from env import get_db_url
import pandas as pd
import numpy as np

### 1) Acquire customer_id, monthly_charges, tenure, and total_charges from telco_churn database for all customers with a 2 year contract.

In [176]:
url = get_db_url('telco_churn')
df = pd.read_sql('''
SELECT customer_id, monthly_charges, total_charges
FROM customers
where contract_type_id = 3
''', url)

In [177]:
df.head(5)

  customer_id  monthly_charges total_charges
0  0013-SMEOE           109.70       7904.25
1  0014-BMAQU            84.65        5377.8
2  0016-QLJIS            90.45        5957.9
3  0017-DINOC            45.20       2460.55
4  0017-IUDMW           116.80       8456.75

In [178]:
df.shape

(1695, 3)

In [179]:
df.describe()

       monthly_charges
count      1695.000000
mean         60.770413
std          34.678865
min          18.400000
25%          24.025000
50%          64.350000
75%          90.450000
max         118.750000

In [180]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 3 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
total_charges      1695 non-null object
dtypes: float64(1), object(2)
memory usage: 39.8+ KB

### 2) Walk through the steps above using your new dataframe. You may handle the missing values however you feel is appropriate.

In [181]:
# no null values
# total_charges may have some wrong data causing values to be object instead of floats

In [182]:
df.sort_values('total_charges').head(15)

     customer_id  monthly_charges total_charges
524   3213-VVOLG            25.35
416   2520-SGTTA            20.00
678   4075-WKNIU            73.35
234   1371-DWPAZ            56.05
941   5709-LVOEQ            80.85
453   2775-SEFEE            61.90
505   3115-CZMZD            20.25
1293  7644-OMVMY            19.85
726   4472-LVYGI            52.55
716   4367-NUYAO            25.75
428   2587-YNLES            20.10        100.35
1398  8219-VYBVI            25.00       1004.35
109   0621-CXBKL            18.70        1005.7
570   3472-QPRCH            25.25        1006.9
1248  7427-AUFPY            19.65        1008.7

In [183]:
df_clean = df[df.total_charges != ' ']

In [184]:
df_clean.total_charges = df_clean.total_charges.apply(float)

In [185]:
df.shape

(1695, 3)

In [186]:
df.describe()

       monthly_charges
count      1695.000000
mean         60.770413
std          34.678865
min          18.400000
25%          24.025000
50%          64.350000
75%          90.450000
max         118.750000

### 3) End with a python file wrangle.py that contains the function, *wrangle_telco()*, that will acquire the data and return a dataframe cleaned with no missing values.

In [199]:
def wrangle_telco(df):
    for i, col in enumerate(df.columns):
        df.replace(r'^\s*$', np.nan, regex=True, inplace=True)
    return df
def drop_nulls(df):
    return df.dropna()

In [200]:
df.shape

(1695, 3)

In [201]:
df_clean = wrangle_telco(df)

df_clean.sort_values('total_charges').tail(15)

     customer_id  monthly_charges total_charges
731   4526-EXKKN            24.60        973.95
442   2675-IJRGJ            19.65           978
582   3521-HTQTV            26.10        980.35
714   4361-FEBGN            20.15        982.95
1503  8874-EJNSR            25.20        987.95
234   1371-DWPAZ            56.05           NaN
416   2520-SGTTA            20.00           NaN
453   2775-SEFEE            61.90           NaN
505   3115-CZMZD            20.25           NaN
524   3213-VVOLG            25.35           NaN
678   4075-WKNIU            73.35           NaN
716   4367-NUYAO            25.75           NaN
726   4472-LVYGI            52.55           NaN
941   5709-LVOEQ            80.85           NaN
1293  7644-OMVMY            19.85           NaN

In [203]:
df_clean = drop_nulls(df_clean)
df_clean.shape

(1685, 3)